#задача1
print('задание1')
x = int(input('Введите произвольное первое число:  '))
y = int(input('Введите второе произвольное число:  '))
symma = x + y
res = symma / 2
print('ответ: ',res)


#задача2
print('задание2')
x = int(input('Введите произвольное первое число:  '))
y = (x**3) / (2*(x+5))
print ('ответ: ',y)


#задача3
print('квадратное уравнение(номер3):')
a = int(input('Введите a:  '))
b = int(input('Введите b:  '))
c = int(input('Введите c:  '))
D=b**2 - 4*a*c
if D>0:
    x1 = (-b + D**0.5) / (2*a)
    x2 = (-b - D**0.5) / (2*a)
    print('x1= ',x1)
    print('x2= ',x2)
else:
    print('такое не решаем')

    
#zadanie8
print('задание8')
x = (5+3**2)-(18*4)+(120/5)
y = (25.5+4.2**2)-(125/5)
print('ответ на 1 уравнение: ',x)
print('ответ на 2 уравнение: ',y)


#задание7
print('задание7')
z = int(input('Введите произвольное число:  '))
if z%2==0:
    print('это число четное')
else:
    print('это число нечетное')

#задание5    
print('задание5')
a = int(input('Введите 1 угол:  '))
b = int(input('Введите 2 угол:  '))
с = 180 - a - b
if c >0:
    print ('такой трегоульник существует')
    if a==90 or b==90 or c ==90:
        print('он прямоугольный')
    else:
        print('он не прямоугольный')
else:
    print('такого треугольнка нету')
#задание6
    print('задание6')
t = int(input('введите температуру:  '))
if t<=0:
    print('твердое(лед)')
elif t<=100:
    print('жидкое')
else:
    print('газообразное')

#задача9
print('задание9')
x = int(input('Введите произвольное первое число:  '))
y = int(input('Введите второе произвольное число:  '))
d1 = x**y
d2 = d1/x
d3 = d1%x
print('остаток от деление:',d3)

# задача10
a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
print("Обычное деление:", a / b)
print("Целочисленное деление:", a // b)

# задача11
a = float(input("Введите дробное число: "))
b = int(input("Введите целое число: "))
print("Остаток от деления:", a % b)


    









